In [1]:
import pandas as pd
from io import StringIO

In [2]:
data = '''
姓名 年龄 学校 成绩 类别
小明 15  一中  99   4
小美 12  一中  63   1
灰灰 19  一中  85   2
铭铭 12  一中  76   2
豪豪 15  一中  55   4
小黄 18  二中  68   3
小黑 16  二中  85   3
'''

In [3]:
df = pd.read_csv(StringIO(data), delim_whitespace=True)
df

   姓名  年龄  学校  成绩  类别
0  小明  15  一中  99   4
1  小美  12  一中  63   1
2  灰灰  19  一中  85   2
3  铭铭  12  一中  76   2
4  豪豪  15  一中  55   4
5  小黄  18  二中  68   3
6  小黑  16  二中  85   3

In [4]:
(
    df.groupby(['年龄', '学校'])
    .filter(lambda x: (len(x) > 1) & (1 not in x.类别))
)

   姓名  年龄  学校  成绩  类别
0  小明  15  一中  99   4
4  豪豪  15  一中  55   4